[
    {
      "id": "33",
      "timestampAt": "4 июня 2023г.",
      "hashtag":[{"name": "😤 горд"}],
      "title": "Портфолио - лицо человека",
      "text": "Портофолио готово🥳, оно мне оно очень очень нравится, даааа в нём нет ничего такого, но я им горд и это моя история, и она не заканчивается, дальше мы идёт на финишную прямую🏁,и это трудоустройство, и я надеюсь что в скором времени, буду писать посты о том как работается, какого это писать свои проекты и писать проекты для другого)😅",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1115815066097418292/image.png"
    },
    {
      "id": "32",
      "timestampAt": "19 мая 2023г.",
      "hashtag":[{"name": "🎴 визитка"}],
      "title": "Портфолио быть",
      "text": "Наконец-то вся моя писанина, и мой мини дневник приобритёт виртуальное состояние, так что если вы видете этот пост, то сайт уже готов, ура ура ура!🙌🙌🙌\nПрименю всё что накопил по своим знаниям, чтоб даже через 5 лет я зашёл в своё портфолио и гордился им, как своим сыном!😂"
     },
    {
      "id": "31",
      "timestampAt": "14 мая 2023г.",
      "hashtag":[{"name": "💪 прокачка"}],
      "title": "А теперь серьёзно!",
      "text": "Опять я сижу у разбитого корыта, что же со мной такое, вроде знаю всё, а вроде и ничего, синдром самозванца, не иначе как😭\nИ теперь у меня обратная диелема, с бэком я разобрался и могу худобедно что-то сделать, есть какая-то структура и понимания как это маштабировать, но вот с фронтом, ни понятния архитектуры, ни структуры приложения, ни тем более масштабирования, и к сожалению таких курсов мало, а то вообище нет.\nМой любиииимый ютубер(Ulbi TV)  объявил новый поток, прям судьма🤩, и было решение отдолжить денег, и купить курс, ибо скидка меня не ждала!\n\nТак что меня ждёт 4 месяца жёсткой прокачки во веб-разработке, курс максимально углублённый, я даже половину слов не знаю😅, удачи мне!\n\nСсылочка под изображением👇",
      "siteLink": "https://ulbitv.ru/frontend",
      "img": "https://i.ytimg.com/vi/S3ZGcFDp4RM/sddefault.jpg"
     },
     {
      "id": "30",
      "timestampAt": "14 мая 2023г.",
      "hashtag":[{"name": "🪄 магия"}],
      "title": "Сам себе режиссёр",
       "text": "Сразу к делу, у есть приложение возможность аунтификации и авторизации с помощью JWT token, функции приложения это написания постов и лайков их, а так же удаление постов.\n\nНу как круто? Сам в шоке😅 \nПрактика просто фантастическая, разработка-обучение на удивление шла глатко, это радует и изучены множество аспектов начиная как работает авторизация заканчивая выгрузку приложения VPS и с работой Nginx. \nКонечно становиться FullStack разработчиком я не планирую, уж слишком тяжко им быть, но для себя очень полезно знать!💯  ",
       "siteLink": "http://fav-post.1560237-co27853.twc1.net/",
       "githubLink": "https://github.com/SeniorToster/Fav-Post",
       "img": "https://camo.githubusercontent.com/ea7cbcb5b5da95e19a2efb0f5242466d5a71d5f6380aa3da95f2bb4c6e734494/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313130373034373733303835303832383333392f696d6167652e706e67"
     },
     {
      "id": "29",
      "timestampAt": "26 апреля 2023г.",
      "hashtag":[{"name": "😎 полный комплект"}],
      "title": "Я FullStack в теории",
      "text": "Был выучен в теории работы Node.js и Express, благо с БД я уже работал у дискорд бота, так что полный комплект FullStack😎, в теории😅 \nБлагодаря изучению бэка, многе стало на свои места, как всё работает, и как вообще строится веб-приложение, и как работает движок V8, сам JS, короче каждый уважающий фронтендер, должен хотя бы в теории знать как работает бэк👺 \n\nТак что пора браться за дело, FullStack приложение по написанию постов, авторизации и аунтификации\n\nКурс как всегда на высоте, чел базовый, ему бы медаль выдать, одобряю его, надо бы похорошему вообще все его курсы посмотреть🤘 "
     },
    {
      "id": "28",
      "timestampAt": "22 апреля 2023г.",
      "hashtag":[{"name": "🧑‍🔧 работяга"}],
      "title": "Отправляемся в тыл",
      "text": "Опять я начал рефлексировать😿 \nПросто сижу смотрю и понимаю, что я совсем не понимаю как строится веб-приложение, если фронт я ещё худо бедно понимаю, то с backend, прям вообще тьма🙁. \nПоэтому принято решение выучить его, идём так сказать уже к FullStack разработке😎.\n\nКурс был выбран моего любимого базиста по Node.js. Курс: Node.js - Полный Курс по Node.js\nCcылка в под изображением😊",
      "img": "https://img-c.udemycdn.com/course/240x135/5228176_e100_5.jpg",
      "siteLink": "https://www.udemy.com/course/nodejs-ru"
     },
    {
      "id": "27",
      "timestampAt": "20 апреля 2023г.",
      "hashtag":[{"name": "❓ это что за покемон"}],
      "title": "Практика на покемонах",
      "text": "Решил для себя по практиковаться, и вспоминть как писать на этом вашем новомодном React🧓, при этом применил в практику Redux Toolkit",
      "siteLink": "https://pokedexpokemons.netlify.app/",
      "githubLink": "https://github.com/SeniorToster/pokedex",
      "img": "https://camo.githubusercontent.com/6ef109405a8930f350b2a5f421d9c419eb156b9ef25dc306499ebfed5ccca0d1/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039383639323339303433383538303336342f5a785a354a67415145415656316c746b684152496741524967415249674162635144394f47594736784938426741414141424a52553545726b4a6767672e706e67"
    },
    {
      "id": "26",
      "timestampAt": "4 арпеля 2023г.",
      "hashtag":[{"name": "🤔опять дежавю"}],
      "title": "Опять рефакторим TodoList",
      "text": "Бедный наш TodoList, всё на нём испытваем новые технологии, которые мы изучили, тут сказать мало что можно, просто применил практику, то что выучил, с виду он не поменялся, но внутри многое было переписано, как-то так 👺\n\nПо поводу RTK, это Context на максималках, всё сделано для людей, я иногда поражаюсь, как всё делают для таких программистов как я🤡, чтоб мы только не накосячили, и делали как надо, вообщем круто!"
    },
    {
      "id": "25",
      "timestampAt": "20 марта 2023г.",
      "hashtag":[{"name": "🧑‍💼 менеджер"}],
      "title": "Redux и с чем его едят",
      "text": "Опять за учёбу🫠\nНа сей раз у нас стейт менеджер Redux, Redux Toolkit и RTK Query!\nМощней стейт менеджер, мощнейший набор инструментов и мощнейший инструмент для работы с кэшем!\n\nИ всё это я буду учить, по тому же курсу, что и прошлый от Иван Петриченко"
    },
    {
      "id": "24",
      "timestampAt": "14 марта 2023г.",
      "hashtag":[{"name": "🎰 джекпот?"}],
      "title": "Тостёнок пожирнел",
      "text": "Пожирнел он у нас в плане команд, теперь у нас есть целая экономика🤯, где можно купить за нашу валюту(ТостКоин🪙), пару интересных вещь, а это кастомная роль, кастомный смайлик, допольнительный голос для голосования фильмов, а так же можно пойти и поиграть в разные игры, которые я тоже добавил, а это: Русская рултека с другим учасником, обычныая рулетка, и орёл и решка!\nДальнейшея его разработка приостанавливается, только поддержка не более, ибо мне надо дальше учиться Frontend разработке.\n\nБота я нивкоем случае на забарасываю у меня на него очень много планов, но про них я вам расскажу, когда снова возьмусь за него😊",
      "siteLink": "https://discord.com/invite/d59DpKbscb",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1115709205882609794/image.png"
    },
    {
      "id": "23",
      "timestampAt": "18 февраля 2023г.",
      "hashtag":[{"name": "🧟 оно живое"}],
      "title": "Тостёнок ожил!",
      "text": "Теперь моего бота зовут Тостёнок(очень оригинально🥴)\nДа, он теперь работает, поздравьте его,c первыс проведением голосования, он молодец!🦾\n\nЧестно говоря я в шоке, оно работает, да нужно править множество багов, что в коде, что в UI, но главное что он выполняет то что теперь мне не надо выполнять, радости нет предела.\n\nБольшое спасибо моим ребятам с сервера, благодаря их отзывам и нахождению разных багов, он становился и будет становится только лучше❤️ \n\nТак же я записал КОРООООТЕНЬКОЕ видео, по работе с ним🤡",
      "siteLink": "https://discord.com/invite/d59DpKbscb",
      "video": "https://www.youtube.com/embed/qt2twvVAfBg"
    },
    {
      "id": "22",
      "timestampAt": "16 января 2023г.",
      "hashtag":[{"name": "😲 куда?"}],
      "title": "Я устал, Я ухожу",
      "text": "Да да, я принял волевое решение, и перестаю учить Frontend, ибо ухожу писать discord bot\"a🤡 \n\nЯ честно сам не ожидал! Просто кто не знает, у меня есть свой маленький дискорд сервер, где мы вместе чилим, играем, смотрим, и тд. Так вот зачем он мне🤔? Просто все же знают поговорку \"лень -двигатель прогресса\", так вот мы каждую неделю смотрим 1 из 3 фильмов, которые были выставлены на голосовании, но голосование делал я каждую неделю, и меня это уже настолько достало, спрашивать у людей, что ставить на голование и проводить их, что было решено, сделать бота, чтоб он всё делал автоматический сам, без какого-либо вмешательства, так что принимаюсь за работу🫡 \n\n То что вы видите на изображении будет делать бот,а не я, клянусь вам!🥸 \n\nСсылка на инвайт сервера под постом😉 ",
      "siteLink": "https://discord.com/invite/d59DpKbscb",
      "img": "https://cdn.discordapp.com/attachments/861882036637270056/1071666497832882186/6cea42eb3636a4d1.png"
    },
    {
      "id": "21",
      "timestampAt": "13 января 2023г.",
      "hashtag":[{"name": "🎞️ смотрим!"}],
      "title": "Теперь у меня свой Кинопоиск!",
      "text": "С прошедшими вас праздниками! Я спустя полтора месяца, всё же сделал этот достаточно на мой взгяд большой проект, работой с АПИ, с роутингом, с Стейт Менеджерами, и много разных не понятных слов😅 \n\nНа мой взгяд, я прокачался достаточно сильно, ибо применял множество разных методик работы, да не всё идеально, но это мой первый такой проект, и я горжусь им.\nМожет он сделал не так качественно со стороны программного кода, но состорны пользователя всё на высшем уровне.😤 ",
      "siteLink": "https://wave-tv.netlify.app/",
      "githubLink": "https://github.com/SeniorToster/Wave.tv-films-react",
      "img": "https://camo.githubusercontent.com/da677ecb84001e5f9fc2f07eb95a141c509b998ed7a5ea5222230b6c29b11666/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039383639323938373733363832353939362f696d6167652e706e67"
    },
    {
      "id": "20",
      "timestampAt": "31 декабрья 2022г.",
      "hashtag":[{"name": "2️⃣ 0️⃣ 2️⃣ 3️⃣ !"}],
      "title": "С новым годом программёры!",
      "text": "С наступающим  вам программёры, и читатели, желаю вам добиваться успехов и не останавливаться на пол пути, чтоб вас окружали любящие люди, и всегда вас поддерживали в ваших начинаниях🥰 \n\nА по поводу проекта фильмов, он делается просто много чего произошло, и болел ангиной🤒 и дела другие😒, НО, он почти готов, так что ждите! "
    },
    {
      "id": "18",
      "timestampAt": "26 ноября 2022г.",
      "hashtag":[{"name": "🎞️ смотрим?"}],
      "title": "У меня будет свой Кинопоиск",
      "text": "С блэкджеком и просмотрами!😅 \n\nРешил сделать проект по поиску, просмотру фильмов, а так же актёрскому соства фильма, ну добавления в закладки!\n\nКурс я посмотрел только связано с React. Redux решил пока отлоджить, ибо это ещё одна большая тема, но пока не буду точно уверен, что прям хорошо овладел React, на Redux не перейду. \nСам курс очень хороший, если прошлый он обьяснял базу работы React, то этот курс больше показывает практики и разных подходов к разработке, и как правильно писать React, то чего мне не хватало, отднозначно лайк и репост, советую👍(мне прям везёт на хоршие курсы🤔) "
    },
    {
      "id": "17",
      "timestampAt": "20 ноября 2022г.",
      "hashtag":[{"name": "🤤 голодный на знания"},{"name": "😔 взамешательстве"}],
      "title": "Нужно больше знаний!",
      "text": "Посидел покумекал и понял, что надо бы глянуть ещё один курс по React, ибо чувствую что чего-то не уловил, может методика разработки нета, может, что-то ещё, незнаю в голове каша😵‍💫, даже сказал бы паника😨, вроде как базу выучил, но сижу у разбитого корыта☹️, не знаю за что взяться, решил глянуть ещё один курс, многие его советуют, ссылочку скину, короче посмотрим, главное не унывать и двигаться к цели!🤩",
      "siteLink": "https://www.udemy.com/course/javascript_full/",
      "img": "https://img-c.udemycdn.com/course/750x422/1901422_8f67_5.jpg"
    },
    {
      "id": "16",
      "timestampAt": "17 ноября 2022г.",
      "hashtag":[{"name": "🤔 дежавю"}],
      "title": "Рефакторим TodoList на React",
      "text": "Вот и прошёл месяц, и что могу сказать по поводу \"Реагировать\"😅, его было с таким кайфом учить, и так легко, что я просто не верю, что он по факту простой, да, есть свои нюансы, но после работы нативного JS переходит на React, очень просто, ибо ты со всем сталкивался, но в React это сделана можно сказать прям для людей)😍 \n\nА по поводу курса, препопадавател не подвёл, как всегда начинает c базы, и принцип работы React, короче советую!👍 \n\nПо поводу практики, решил просто переписать свой TodoList, но уже на реакт и добавить пару фичей, и скажу что мне было очень комфортно писать, без нервротрёпки и не понимания, как-то само собой, пока от React только позитивные эмоции🥰",
      "siteLink": "https://master--toster-todo-react.netlify.app/",
      "githubLink": "https://github.com/SeniorToster/project-7_todo_react",
      "img": "https://camo.githubusercontent.com/a8b66d317fa57a717cd86cf3dcb2880872d552663177e496624df20e45fb823d/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039383935303034303233333435353631362f696d6167652e706e67"
    },
    {
      "id": "15",
      "timestampAt": "16 октября 2022г.",
      "hashtag":[{"name": "⚛️ реагируем"}],
      "title": "React - это библиотека!",
      "text": "Да да, теперь время пришло сложного выбора, какой мне фреймворк выбрать🤔 \nМного думал, плакал, но решил что зачем мне фрейморки, если есть библиотека React, так что буду учить его! \n\nКурс я выбрал того же преподавателя, уж больно он мне понравлся, как преподаёт и доносит информации, ссылочку прикреплю🥰 \n\nУвидимся через месяц, а может и меньше👋",
      "img": "https://img-c.udemycdn.com/course/750x422/4782518_1d83_3.jpg",
      "siteLink": "https://www.udemy.com/course/react-ru/"
    },
    {
      "id": "14",
      "timestampAt": "14 октября 2022г.",
      "hashtag":[{"name": "🏙️ районы, кварталы, жилые массивы"}],
      "title": "Напоминалка методов",
      "text": "Решил так сказать для себя, а может и для других сделать напоминалку для некоторых методов массива, на удивление очень было просто её написать по сравнению с другими проектами, или же я стал круче😏 \n\nСсылочка как всегда под изображением!",
      "img": "https://camo.githubusercontent.com/81a896eea668bc4f48f9fb619dc26068c3c8d6e4a9dad7b6a92436e49c48462b/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039393433363438313930383537323230312f696d6167652e706e67",
      "siteLink": "https://seniortoster.github.io/project-6-Arrays-and-Methods/",
      "githubLink": "https://github.com/SeniorToster/project-6-Arrays-and-Methods"
    },
    {
      "id": "13",
      "timestampAt": "13 октября 2022г.",
      "hashtag":[{"name": "⏲️ считаем"}],
      "title": "Работа с числами",
      "text": "Решил я дальше закреплять практику с DOM, и начал делать таймер, это была моя самая большая ошибка, это были просто мучения работы с таймером, интервалами, да и вообще с числами, просто ад🪦, понял что это вообще не моё🫤.",
      "img": "https://camo.githubusercontent.com/cd9bfde0a1f731df12791a8ae744b20bd2b23393f87e0423e0dc50657c50264c/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313130303532313230363337303739353533302f696d6167652e706e67",
      "siteLink": "https://seniortoster.github.io/project-5-Timer/",
      "githubLink": "https://github.com/SeniorToster/project-5-Timer"
  },
  {
      "id": "12",
      "timestampAt": "6 октября 2022г.",
      "hashtag":[{"name": "🗒️ записываем"}],
      "title": "Todo List - это база",
      "text": "Написания своего Todo list\"a - это своего рода практический экзамен на понимания всего, что ты до этого выучил, но если вы написали его, то знайте, вы волшебник и большой молодец.\n\nСсылку на Todo List прикреплю😉",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1098950040233455616/image.png",
      "siteLink": "https://seniortoster.github.io/project-4-ToDo-List/",
      "githubLink": "https://github.com/SeniorToster/project-4-ToDo-List"
  },
  {
      "id": "11",
      "timestampAt": "1 октября 2022г.",
      "hashtag":[{"name": "🏠 я в домике"}],
      "title": "Document Object Module",
      "text": "JS это конечно круто, но теперь возникает вопрос, как же нам теперь объеденить HTML, CSS и JS🤔, и напомщь на приходит DOM🏠, если невдаваться в подробности то это штучка даёт возможднсть изменить HTML и СSS с помощью JS, если у вас богатое воображение, вы можете представить на сколько это круто, и по сути вся логика, все кнопочки, модальные окна и тд, работают благодаря DOM и JS😮 \n\nТак что магия начинается с именно с этого момента, так что в дальнейшем проекты будут оживать в прямом смысле слова🙀"
  },
  {
      "id": "10",
      "timestampAt": "20 сентября 2022г.",
      "hashtag":[{"name": "🙃 практика"}],
      "title": "Практика Практика Практика",
      "text": "Практика!\n\nДа, да, именно она, без неё теорию не закрепишь, это как послушать лекцию и не записать её, посидел глазками похлопал и пошёл дальше по своим делам🙂 \n\n Но возникает вопрос где эту практику искать, лично у меня выбор пал на сайт CodeWars, там множество различных задач по разным ЯП, с разной сложностью, а так же спаринги между учасниками, короче идеальная вешь для практики, советую вам!👍\n\nСсылочку на свой профиль прикреплю, добавляйтесь, будем соревноваться, кто круче😎",
      "img": "https://www.codewars.com/users/Toctep/badges/large",
      "siteLink": "https://www.codewars.com/users/Toctep"
  },
  {
      "id": "9",
      "timestampAt": "9 сентября 2022г.",
      "hashtag":[{"name": "🤯 мозг кипит"}],
      "title": "Это просто ...",
      "text": "И так прошёл почти месяц с начало изучения курса, я лично думал что раз два и готово, но как же я был наивен. Мне от столькой информации аж голова болела, но это очень.\n Я за этот месяц принял все стадии отрицания 😅 \n\nИ так поныли и хватит, теперь к курсу. Курс это квинтенсенция базы, по началу ты вообще не вдупляешь что происходит, но преподаватель вкладыват нашу голову базис JS, а потому уже разбирает типы, методы, функции и тд. Ещё поправочка он не разбирает DOM JS, так что учтите, НО КУРС ПРОСТО БОМБЕЗНЫЙ, безоговорочно советую!",
      "siteLink": "https://www.udemy.com/course/javascript-ru/"
  },
  {
      "id": "8",
      "timestampAt": "19 августа 2022г.",
      "hashtag":[{"name": "🐸 скрип"}],
      "title": "Привет JavaScript",
      "text": "И так теперь у нас тяжёлая артелерия и настроящий языка программирования и это JavaScript😳! \nКурс, который я выбрал, очень много положительных отзывов, поэтому у меня большие ожидания насчёт него🤩!\n\nКурс: JavaScript - Полный Курс По JavaScript (Включает 80 Задач)\nСсылка как всегда под изображением 👇",
      "img": "https://img-c.udemycdn.com/course/750x422/4450454_36df_6.jpg",
      "siteLink": "https://www.udemy.com/course/javascript-ru/"
  },
  {
      "id": "7",
      "timestampAt": "16 августа 2022г.",
      "hashtag":[{"name": "🪦 умер"}],
      "title": "Было сложно!",
      "text": "Фуууух, это было чертовский сложно, даже не сам макет, а мой друг, который всё советовал да советовал, как лучше сделать, что аж добавили чучуть JavaScript, который я воооообще не знаю, но это была просто мощнейшая парктика, методология БЭМ это просто супермегакруто, в разы легче писать HTML разметку и SCSS, кстати про SCSS, вот он заиграл красками, а вместе с БЭМом это просто сказка, иделальное сочетание🥰 \n\nКстати, если зайдёте на сайт, гляньте на меню сайта и на главном экране попробуйте переключить фоны, вы офигеете!😁 ",
      "img": "https://camo.githubusercontent.com/2d03aba9b965f91eba3de47aec093ec1adb8fbcb76fc69280fc3c6ff1a43d6e6/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039393830303134393439343038333733342f696d6167652e706e67",
      "siteLink": "https://pokedexpokemons.netlify.app/",
      "githubLink": "https://github.com/SeniorToster/pokedex"
  },
  {
      "id": "6",
      "timestampAt": "10 августа 2022г.",
      "hashtag":[{"name": "😵‍💫 замахнулся"}],
      "title": "Новый проект",
      "text": "Был взять макет в просторах интернета, достаточно сложен на мой взгяд, но это даже лучше, к тому попробую методологию БЭМ и SCSS🥸.\n\nСсылку на макет в Figma прикреплю под изображением😉",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114637018731925615/image.png",
      "siteLink": "https://www.figma.com/file/mnYBPKYlXuOJ9UN4KpaRNh"
  },
  {
      "id": "5",
      "timestampAt": "9 августа 2022г.",
      "hashtag":[{"name": "🥳 финиш"}],
      "title": "Закончен курс",
      "text": "И так мною был закончен первый курс, и что я могу сказать по первому финишу🥰. \nБыло супер интересно, я понимаю что я только в начале пути, и это завораживает, что же меня ждёт дальше!😁 \n\nЧто по поводу курса? Он хороший, но чего-то не хватает, но всё же базе он изучил, так что для начала своего пути советую его.\n\n Так же я нашёл очень полезную штуку, это ROADMAP, можно смотреть, что учить дальше и по нарастающей сложности, ссылочку на Frontend Roadmap прикреплю)😊 ",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114627619212767242/image.png",
      "siteLink": "https://roadmap.sh/frontend"
  },
  {
      "id": "4",
      "timestampAt": "8 августа 2022г.",
      "hashtag":[{"name": "💪 прогрессируем"}],
      "title": "Сайт посолиднее",
      "text": "И так это уже мой второй сайт, был выучен так же предпроцессор SASS, НО он вроде бы не плохой, ибо мы убираем ковычки, но чем больше Css кода тем сложнее его читать, ну такое 😕. Но зато очень удобная вложеность, короче есть свои плюсы и минусы. Главное что есть прогрессия, и обучения новым техологиям, может что-то ещё лучше будет😺 \n\nТак же тоже нельзя не сказать, что сайт был также спроектирован с нуля в Figma, вещь просто нереальная, я представляю как раньше веб-дизайнеры мучались в Photoshop🥲.",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114617741530386443/image.png"
  },
  {
      "id": "3",
      "timestampAt": "5 августа 2022г.",
      "hashtag":[{"name": "🧙 я чёртов маг"}],
      "title": "Первый сайт!",
      "text": "Вы только вгзляните на это чудо! Мой первый сайт, это конечно не Apple, НО мы только начинаем, пока супер интересно, главное что я вижу МОМЕНТАЛЬНО результат 🤯, и могу наводить красоту как вообще моей душе угодно, мой маленький перфекционист ликует😁",
      "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114614502760136836/image.png"
  },
  {
      "id": "2",
      "timestampAt": "3 августа 2022г.",
      "hashtag":[{"name": "🤔 выбираем"}],
      "title": "Что там по курсам?",
      "text": "Так как я безработный, а соответсвенно и безденежный молодой человек, а учиться по ютубу это конечно хорошо, но нету структуры повествования, а искать везде по крупице во всей всемирной паутине желание не больше, было принято решение ВРЕМЕНО пиратить курсы💀. Да да да, это плохо, ибо им тоже надо кушать, НО я даю руку на отсечение, что когда я получу свою первую ЗП(если она вообще когда-то будет🥹 ) в сфере FrontEnd, я у них всё куплю!!!😤 \n\nИ так первый курс это у нас будет по HTML, СSS и какому-то препроцессору Sass, а так же обучение работы с Figma(photoshop для веб-дизайнеров).\n\nКурс: Верстка и создание веб сайтов 2022 - с нуля до результата!\nСсылку прикрепил под картинокой)    ",
      "img": "https://img-c.udemycdn.com/course/750x422/4498024_2e32_4.jpg",
      "siteLink": "https://www.udemy.com/course/dmitrii-fokeev-web-dev-essential/"
  },
  {
      "id": "1",
      "timestampAt": "1 августа 2022г.",
      "hashtag":[{"name": "💻 новое хобби"}],
      "title": "Hello World!",
      "text": "Привет мир! Это мой мини кринжовый блог🥴, где я буду писать посты, чем я занимаюсь в сфере программирования)\n\n И сегодня был выбран путь, в какую сферу я пойду, и это веб-программирование! Так что начинаем учить HTML и CSS) 😎",
      "img": "https://vscode.ru/wp-content/uploads/2017/11/hello-world.jpg"
  }
]