[
  {
    "id": "9",
    "timestampAt": "9 сентября 2022г.",
    "hashtag":[{"name": "🤯 мозг кипит"}],
    "title": "Это просто ...",
    "text": "И так прошёл почти месяц с начало изучения курса, я лично думал что раз два и готово, но как же я был наивен. Мне от столькой информации аж голова болела, но это очень\n\n ",
    "img": "https://img-c.udemycdn.com/course/750x422/4450454_36df_6.jpg",
    "siteLink": "https://www.udemy.com/course/javascript-ru/"
  },
  {
    "id": "8",
    "timestampAt": "16 августа 2022г.",
    "hashtag":[{"name": "🐸 скрип"}],
    "title": "Привет JavaScript",
    "text": "И так теперь у нас тяжёлая артелерия и настроящий языка программирования и это JavaScript😳! \nКурс, который я выбрал, очень много положительных отзывов, поэтому у меня большие ожидания насчёт него🤩!\n\nКурс: JavaScript - Полный Курс По JavaScript (Включает 80 Задач)\nСсылка как всегда под изображением 👇",
    "img": "https://img-c.udemycdn.com/course/750x422/4450454_36df_6.jpg",
    "siteLink": "https://www.udemy.com/course/javascript-ru/"
  },
  {
    "id": "7",
    "timestampAt": "16 августа 2022г.",
    "hashtag":[{"name": "🪦 умер"}],
    "title": "Было сложно!",
    "text": "Фуууух, это было чертовский сложно, даже не сам макет, а мой друг, который всё советовал да советовал, как лучше сделать, что аж добавили чучуть JavaScript, который я воооообще не знаю, но это была просто мощнейшая парктика, методология БЭМ это просто супермегакруто, в разы легче писать HTML разметку и SCSS, кстати про SCSS, вот он заиграл красками, а вместе с БЭМом это просто сказка, иделальное сочетание🥰 \n\nКстати, если зайдёте на сайт, гляньте на меню сайта и на главном экране попробуйте переключить фоны, вы офигеете!😁 ",
    "img": "https://camo.githubusercontent.com/2d03aba9b965f91eba3de47aec093ec1adb8fbcb76fc69280fc3c6ff1a43d6e6/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f313037313938383330323937313934343938322f313039393830303134393439343038333733342f696d6167652e706e67",
    "siteLink": "https://pokedexpokemons.netlify.app/",
    "githubLink": "https://github.com/SeniorToster/pokedex"
  },
  {
    "id": "6",
    "timestampAt": "10 августа 2022г.",
    "hashtag":[{"name": "😵‍💫 замахнулся"}],
    "title": "Новый проект",
    "text": "Был взять макет в просторах интернета, достаточно сложен на мой взгяд, но это даже лучше, к тому попробую методологию БЭМ и SCSS🥸.\n\nСсылку на макет в Figma прикреплю под изображением😉",
    "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114637018731925615/image.png",
    "siteLink": "https://www.figma.com/file/mnYBPKYlXuOJ9UN4KpaRNh"
  },
  {
    "id": "5",
    "timestampAt": "9 августа 2022г.",
    "hashtag":[{"name": "🥳 финиш"}],
    "title": "Закончен курс",
    "text": "И так мною был закончен первый курс, и что я могу сказать по первому финишу🥰. \nБыло супер интересно, я понимаю что я только в начале пути, и это завораживает, что же меня ждёт дальше!😁 \n\nЧто по поводу курса? Он хороший, но чего-то не хватает, но всё же базе он изучил, так что для начала своего пути советую его.\n\n Так же я нашёл очень полезную штуку, это ROADMAP, можно смотреть, что учить дальше и по нарастающей сложности, ссылочку на Frontend Roadmap прикреплю)😊 ",
    "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114627619212767242/image.png",
    "siteLink": "https://roadmap.sh/frontend"
  },
  {
    "id": "4",
    "timestampAt": "8 августа 2022г.",
    "hashtag":[{"name": "💪 прогрессируем"}],
    "title": "Сайт посолиднее",
    "text": "И так это уже мой второй сайт, был выучен так же предпроцессор SASS, НО он вроде бы не плохой, ибо мы убираем ковычки, но чем больше Css кода тем сложнее его читать, ну такое 😕. Но зато очень удобная вложеность, короче есть свои плюсы и минусы. Главное что есть прогрессия, и обучения новым техологиям, может что-то ещё лучше будет😺 \n\nТак же тоже нельзя не сказать, что сайт был также спроектирован с нуля в Figma, вещь просто нереальная, я представляю как раньше веб-дизайнеры мучались в Photoshop🥲.",
    "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114617741530386443/image.png"
  },
  {
    "id": "3",
    "timestampAt": "5 августа 2022г.",
    "hashtag":[{"name": "🧙 я чёртов маг"}],
    "title": "Первый сайт!",
    "text": "Вы только вгзляните на это чудо! Мой первый сайт, это конечно не Apple, НО мы только начинаем, пока супер интересно, главное что я вижу МОМЕНТАЛЬНО результат 🤯, и могу наводить красоту как вообще моей душе угодно, мой маленький перфекционист ликует😁",
    "img": "https://cdn.discordapp.com/attachments/1071988302971944982/1114614502760136836/image.png"
  },
  {
    "id": "2",
    "timestampAt": "3 августа 2022г.",
    "hashtag":[{"name": "🤔 выбираем"}],
    "title": "Что там по курсам?",
    "text": "Так как я безработный, а соответсвенно и безденежный молодой человек, а учиться по ютубу это конечно хорошо, но нету структуры повествования, а искать везде по крупице во всей всемирной паутине желание не больше, было принято решение ВРЕМЕНО пиратить курсы💀. Да да да, это плохо, ибо им тоже надо кушать, НО я даю руку на отсечение, что когда я получу свою первую ЗП(если она вообще когда-то будет🥹 ) в сфере FrontEnd, я у них всё куплю!!!😤 \n\nИ так первый курс это у нас будет по HTML, СSS и какому-то препроцессору Sass, а так же обучение работы с Figma(photoshop для веб-дизайнеров).\n\nКурс: Верстка и создание веб сайтов 2022 - с нуля до результата!\nСсылку прикрепил под картинокой)    ",
    "img": "https://img-c.udemycdn.com/course/750x422/4498024_2e32_4.jpg",
    "siteLink": "https://www.udemy.com/course/dmitrii-fokeev-web-dev-essential/"
  },
  {
    "id": "1",
    "timestampAt": "1 августа 2022г.",
    "hashtag":[{"name": "💻 новое хобби"}],
    "title": "Hello World!",
    "text": "Привет мир! Это мой мини кринжовый блог🥴, где я буду писать посты, чем я занимаюсь в сфере программирования)\n\n И сегодня был выбран путь, в какую сферу я пойду, и это веб-программирование! Так что начинаем учить HTML и CSS) 😎",
    "img": "https://vscode.ru/wp-content/uploads/2017/11/hello-world.jpg"
  }
]